[M_CriticalFail MissionDefinition]
MissionName="error"
MissionDescription="As a reward for returning to your city, Moki will give you one of his weapons. You must go with him."
TurnInDescription="You are happy, aren't you??"
MissionSummary="Get your moxie gun accessories."
MissionGiver="Moxie's weapon"
MissionTurnInLocation="Shuttle gun"
TeaserText="A little gift for you."

[M_CriticalFail:CriticalFail_FinalRoll MissionObjectiveDefinition]
ProgressMessage="Take off your clothes"

[M_CriticalFail:CriticalFail_FindAgain MissionObjectiveDefinition]
ProgressMessage="Find the gun"

[M_CriticalFail:CriticalFail_FirstFind MissionObjectiveDefinition]
ProgressMessage="Bring a weapon."

[M_CriticalFail:CriticalFail_KillMonster MissionObjectiveDefinition]
ProgressMessage="Defeat the orcs"

[M_CriticalFail:CriticalFail_OS_FightMonster MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy the strange armor and collect the armor for the last time."
MissionDescriptionOverride="To thank you for saving the children from the hotel, Moxie will give you a gun. You have to take it..<br><br>Unfortunately, the first attempt ended in disaster. I aimed and the gun fell from my hand..<br><br>After the second time, it will come out of your hand again..<br><br>The third time you try to grab a weapon, you immediately become a monster with a sword. I hope to kill him in the end to get that cool weapon.."

[M_CriticalFail:CriticalFail_OS_FinalRoll MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CriticalFail:CriticalFail_OS_FindWeaponAgain MissionObjectiveSetDefinition]
MissionSummaryOverride="Restart the application called Mokie."
MissionDescriptionOverride="Moxie gives you a gun as a thank you for getting Harry out of the hotel. You just have to do it..<br><br>Unfortunately, the first time you try to pick it up, the result is disastrous: you make a mistake and the gun falls out of your hand..<br><br>When he tried again, he ran again. The latter is better.."

[M_CriticalFail:CriticalFail_OS_FirstFind MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CriticalFail:CriticalFail_OS_Pickup MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CriticalFail:CriticalFail_OS_Roll MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CriticalFail:CriticalFail_OS_RollAgain MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CriticalFail:CriticalFail_OS_TryToPickup MissionObjectiveSetDefinition]
MissionSummaryOverride="Get the Mox Gun. POSTERIOR."
MissionDescriptionOverride="Moxie will give you one of her guns as thanks for opening the door to her hotel. You have to earn it.<br><br>Unfortunately, your first attempt ends in disaster: you make a mistake and the gun falls out of your hand. you have to see it again."

[M_CriticalFail:CriticalFail_PickupWeapon MissionObjectiveDefinition]
ProgressMessage="Take the device."

[M_CriticalFail:CriticalFail_Roll MissionObjectiveDefinition]
ProgressMessage="Download the package"

[M_CriticalFail:CriticalFail_RollAgain MissionObjectiveDefinition]
ProgressMessage="i fly"

[M_CriticalFail:CriticalFail_TryToPickup MissionObjectiveDefinition]
ProgressMessage="Take the gun"

